from datetime import date

CRAWLER_LOGIN = {
    'url': 'https://www.oureway.com/users/login',
    'username': '18516175174',
    'password': '13919407312'
}

CRAWLER_PAGES = 574

CRAWLER_TARGET = "https://www.oureway.com/market/resources/xj"

today = date.today().strftime("%Y-%m-%d")
FILENAME = f"cotton-{today}.xlsx"

# SINGLE_PAGE_NUM = 100

# 新疆仓库列表
XINJIANG_WAREHOUSES = {
    '库尔勒汇', '奎屯农资', '兵棉宏泰', '阿拉尔鹏', '库尔勒恒',
    '新疆中新', '阿克苏银', '伽师瑞利', '新疆西部', '乌市诸天',
    '巴楚棉储', '阿克苏益', '奎屯陆德', '阿克苏铁', '巴楚润金',
    '库尔勒银', '兵棉润泽', '中储库尔', '奎屯银棉', '阿克苏兵',
    '中供乌苏', '新疆象道', '益美达仓', '昌吉华嵘', '阿克苏华',
    '新疆天运', '乌市棉麻', '大河沿二', '哈密供销', '巴州尉棉',
    '中锦胡杨', '奎屯中亚', '新疆锦葵', '莎车中联', '博州新棉',
    '新疆港汇', '奎屯新亚', '库尔勒大', '石河子通', '乌市米泉'
}

# 内地仓库列表（从所有仓库中去掉新疆仓库）
ALL_WAREHOUSES = {
    '库尔勒汇', '奎屯农资', '兵棉宏泰', '阿拉尔鹏', '库尔勒恒', '新疆中新', '阿克苏银', '伽师瑞利', '新疆西部', '乌市诸天',
    '巴楚棉储', '阿克苏益', '奎屯陆德', '阿克苏铁', '巴楚润金', '库尔勒银', '兵棉润泽', '中储库尔', '奎屯银棉', '阿克苏兵',
    '中供乌苏', '新疆象道', '益美达仓', '昌吉华嵘', '阿克苏华', '新疆天运', '乌市棉麻', '大河沿二', '哈密供销', '巴州尉棉',
    '中锦胡杨', '奎屯中亚', '新疆锦葵', '莎车中联', '博州新棉', '新疆港汇', '奎屯新亚', '库尔勒大', '石河子通', '乌市米泉',
    '江苏银隆', '乌苏亿佳', '河南豫棉', '中棉山东', '滨州中纺', '前海仓储', '菏泽巨野', '江阴协丰', '诚通西部', '菏泽棉麻',
    '金棉仓储', '湖北三三', '厦门象屿', '菏泽转运', '湖北局三', '菏泽经贸', '陕西大唐', '新乡九州', '浙江国储'
}

NEIDI_WAREHOUSES = ALL_WAREHOUSES - XINJIANG_WAREHOUSES